In [134]:
# Constructing the dataframe
names=["Tomás", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

data = {'names': names, 'woman': woman, 'ages': ages, 'country': country, 'education': education}

import pandas
from pandas import DataFrame

friends = DataFrame.from_dict(data)
friends

     names  woman  ages  country education
0    Tomás  False    32    Chile      Bach
1  Pauline   True    33  Senegal      Bach
2    Pablo  False    28    Spain    Master
3    Bjork  False    30   Norway       PhD
4     Alan  False    32     Peru      Bach
5    Juana   True    27     Peru    Master

In [135]:
### Homework

# where is the youngest male in the group from?

# my own answer
male = friends[(friends.woman == False)] 
male[male.ages == min(male.ages)]

   names  woman  ages country education
2  Pablo  False    28   Spain    Master

In [127]:
#a. Find the answer using sort_values()
male.sort_values('ages', ascending=True).head(1)

   names  woman  ages country education
2  Pablo  False    28   Spain    Master

In [146]:
#b. Do some research and find the answer using where() and min()
male.where(male.ages == min(male.ages)).loc[2]

names         Pablo
woman             0
ages             28
country       Spain
education    Master
Name: 2, dtype: object